{
    "I18N.LANGUAGE": "English",
    "pf2e-item-activations": {
        "module-settings": {
            "enabled": {
                "name": "Enable Module",
                "hint": "Enables all functionality of module"
            },
            "action-type-icon": {
                "enabled": {
                    "name": "Overwrite Icon to Action Count Icon",
                    "hint": "When generating actions will use an action count Icon for all relevant (IE 1, 2, 3 etc.)"
                }
            },
            "npc": {
                "enabled": {
                    "name": "Enable NPC Activations",
                    "hint": "Enables all functionality of module for NPCs"
                },
                "on-create-token": {
                    "name": "Add NPC Activations on Token Creation",
                    "hint": "When NPC tokens are placed, runs a check to Add any missing activations"
                }
            },
            "auto-gen": {
                "enabled": {
                    "name": "Enable Automatic Generation",
                    "hint": "Enables automatic generations for activations that haven't been handcrafted. Note these may have less implementation/functionality."
                }
            },
            "debug-mode": {
                "name": "Debug Mode",
                "hint": "Have the console receive messages for different stuff"
            }
        },
        "code": {
            "activation": "Activation",
            "activate": "Activate",
            "frequency": "Frequency",
            "granted-by": "Granted by",
            "activation-traits": {
                "command": "command",
                "envision": "envision",
                "interact": "interact"
            },
            "time": {
                "turn": "turn",
                "round": "round",
                "minute": "minute",
                "ten-minutes": "10 minutes",
                "hour": "hour",
                "twenty-four-hours": "24 hours",
                "day": "day",
                "week": "week",
                "month": "month",
                "year": "year"
            },
            "invalid-activations": {
                "staff": "You expend a number of charges from the staff to cast a spell from its list."
            },
            "per": "per",
            "count": {
                "once": "once",
                "twice": "twice",
                "three-times": "three times"
            }
        },
        "notes": {
            "fortification": "Each time the defender is critically hit while wearing the etched armor, attempt a @Check[flat|dc:17|showDC:all]. On a success, it becomes a normal hit.",
            "greater-fortification": "Each time the defender is critically hit while wearing the etched armor, attempt a @Check[flat|dc:14|showDC:all]. On a success, it becomes a normal hit.",
            "spellhearts": {
                "terms": {
                    "armor": "Armor",
                    "weapon": "Weapon"
                },
                "items": {
                    "clay-sphere": {
                        "weapon": "After you cast a morph or polymorph spell by activating the clay sphere, the weapon becomes malleable, shifting its form to your whims. Your Strikes with the affixed weapon have the versatile bludgeoning, versatile piercing, and versatile slashing trait for 1 minute. Until the end of your next turn, Strikes with the affixed weapon have their damage dice increase by one step."
                    },
                    "compass-of-luong-phung": "In addition to the effects of the cantrip, the compass itself points in the general direction of a sea dragon for 1 minute, with the point glowing brighter as you get closer. Aligning the compass with the constellation of the Sea Dragon at night instead creates a beam for 1 minute to find Luong Phung again.",
                     "five-feather-wreath": {
                        "weapon": "After you cast an air spell by Activating the wreath, you can Fly 5 feet as a single action, or you can Fly (Normal 10, Greater 25, Fly 40) feet as a free action if the spell you cast wasn't a cantrip. This must be your next action, and if you don't have a fly Speed, you must end the flight on solid ground or fall."
                    },
                    "flaming-star": {
                        "weapon": "After you cast a fire spell by Activating the star, Your your Strikes with the weapon deal an additional fire damage until the end of your next turn."
                    },
                    "foxglove-token": {
                        "weapon": "After you cast an plant spell by activating the foxglove token, your Strikes with the weapon deal additional poison damage until the end of your next turn."
                    },
                    "grim-sandglass": {
                        "weapon": "After you Cast a Spell by Activating the sandglass, your Strikes with the weapon deal additional void damage until the end of your next turn."
                    },
                    "heartmoss": {
                        "weapon": "After you cast a healing spell by activating the heartmoss, the weapon exudes a soothing scent. Your Strikes with the affixed weapon have the nonlethal trait for 1 minute. Until the end of your next turn, Strikes with the affixed weapon cause the target to be Stupefied (Normal 1, Greater 2, Major 3) for 1 round if it hits (or for 3 rounds on a critical hit)."
                    },
                    "jolt-coil": {
                        "weapon": "After you cast an electricity spell by activating the coil, your Strikes with the weapon deal additional electricity damage until the end of your next turn."
                    },
                    "perfect-droplet": {
                        "armor": "After you cast a water spell by Activating the droplet, your body becomes mistlike. Until the end of the turn, you can move through enemies' spaces. You can't move through creatures that have the water trait in this way."
                    },
                    "pickled-demon-tongue": {
                        "weapon": "After you cast an acid spell by activating the pickled demon tongue, your Strikes with the weapon deal additional acid damage until the end of your next turn."
                    },
                    "polished-demon-horn": {
                        "weapon": "After you cast an enchantment spell by activating the horn, your Strikes with the weapon deal additional mental damage until the end of your next turn."
                    },
                    "rime-crystal": {
                        "weapon": "After you cast an cold spell by activating the crystal, your Strikes with the weapon deal additional cold damage until the end of your next turn."
                    },
                    "spiny-lodestone": {
                        "weapon": "After you cast a spell by Activating the spiny lodestone, your Strikes with the weapon deal an additional piercing damage until the end of your next turn."
                    },
                    "thorn-triad": {
                        "armor": "After you cast a plant spell by activating the triad, you gain resistance to bludgeoning and piercing damage and weakness to fire until the end of your next turn, or double the resistance for a non-cantrip spell.",
                        "weapon": "After you cast a plant spell by activating the triad, thorns erupt from the weapon. Your Strikes with the weapon deal additional persistent bleed damage until the end of your next turn."
                    },
                    "trinity-geode": {
                        "armor": "After you cast an earth spell by Activating the geode, you gain resistance to physical damage (except adamantine) until the end of your next turn, or double the resistance for a non-cantrip spell.",
                        "weapon": "After you cast an earth spell by activating the geode, your Strikes with the weapon deal additional bludgeoning damage until the end of your next turn."
                    }
                }
            },
            "spells": {
                "joined": "The following spells in this entry are linked together and when one is expended the other will be as well ({spells})"
            }
        }
    }
}
